In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
import datetime as dt

In [3]:
df=pd.read_csv("gapminder-FiveYearData.csv")
df

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [4]:
df.head()#first five column

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [5]:
df.shape #how many rows and column

(1704, 6)

In [6]:
df.columns #print the column name

Index(['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap'], dtype='object')

In [7]:
df.dtypes #it shows  datatypes of the variable

country       object
year           int64
pop          float64
continent     object
lifeExp      float64
gdpPercap    float64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   year       1704 non-null   int64
 2   pop        1704 non-null   float64
 3   continent  1704 non-null   object
 4   lifeExp    1704 non-null   float64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 80.0+ KB

## looking into Row columns and cells

In [9]:
country_df=df[['country']] #print one column at  a time 
country_df

          country
0     Afghanistan
1     Afghanistan
2     Afghanistan
3     Afghanistan
4     Afghanistan
...           ...
1699     Zimbabwe
1700     Zimbabwe
1701     Zimbabwe
1702     Zimbabwe
1703     Zimbabwe

[1704 rows x 1 columns]

In [10]:
country_df.head()

       country
0  Afghanistan
1  Afghanistan
2  Afghanistan
3  Afghanistan
4  Afghanistan

In [11]:
country_df1=df[['country','year','pop','continent']] # it access multiple column at a time 
country_df1.head()

       country  year         pop continent
0  Afghanistan  1952   8425333.0      Asia
1  Afghanistan  1957   9240934.0      Asia
2  Afghanistan  1962  10267083.0      Asia
3  Afghanistan  1967  11537966.0      Asia
4  Afghanistan  1972  13079460.0      Asia

# get the Row

In [12]:
df.loc[0] # first row of the dataset

country      Afghanistan
year                1952
pop            8425333.0
continent           Asia
lifeExp           28.801
gdpPercap     779.445314
Name: 0, dtype: object

In [13]:
df.tail(n=1) #last rows

       country  year         pop continent  lifeExp   gdpPercap
1703  Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

In [14]:
df.loc[[0,99,999]] #printing the 1st ,100th and 1000th rows

         country  year         pop continent  lifeExp    gdpPercap
0    Afghanistan  1952   8425333.0      Asia   28.801   779.445314
99    Bangladesh  1967  62821884.0      Asia   43.453   721.186086
999     Mongolia  1967   1149500.0      Asia   51.253  1226.041130

In [15]:
df.iloc[1]

country      Afghanistan
year                1957
pop            9240934.0
continent           Asia
lifeExp           30.332
gdpPercap      820.85303
Name: 1, dtype: object

In [16]:
df.iloc[-1]

country        Zimbabwe
year               2007
pop          12311143.0
continent        Africa
lifeExp          43.487
gdpPercap    469.709298
Name: 1703, dtype: object

In [17]:
df.iloc[[0,99,999]] #printing the 1st ,100th and 1000th rows

         country  year         pop continent  lifeExp    gdpPercap
0    Afghanistan  1952   8425333.0      Asia   28.801   779.445314
99    Bangladesh  1967  62821884.0      Asia   43.453   721.186086
999     Mongolia  1967   1149500.0      Asia   51.253  1226.041130

In [18]:
ab=df.loc[:,['year','pop']] # :colon is used to access all the rows in python and here it is printing all the rows with two specific rows 
ab

      year         pop
0     1952   8425333.0
1     1957   9240934.0
2     1962  10267083.0
3     1967  11537966.0
4     1972  13079460.0
...    ...         ...
1699  1987   9216418.0
1700  1992  10704340.0
1701  1997  11404948.0
1702  2002  11926563.0
1703  2007  12311143.0

[1704 rows x 2 columns]

In [19]:
#iloc will allow us to use integres and -1 will select the last column 
ab=df.iloc[:,[2,4,-1]]
ab.head()

          pop  lifeExp   gdpPercap
0   8425333.0   28.801  779.445314
1   9240934.0   30.332  820.853030
2  10267083.0   31.997  853.100710
3  11537966.0   34.020  836.197138
4  13079460.0   36.088  739.981106

## subsetting column by ranges

In [20]:
small_range=list(range(5))
small_range # it uses coluns as a number

[0, 1, 2, 3, 4]

In [21]:
ab=df.iloc[:,small_range]
ab.head()

       country  year         pop continent  lifeExp
0  Afghanistan  1952   8425333.0      Asia   28.801
1  Afghanistan  1957   9240934.0      Asia   30.332
2  Afghanistan  1962  10267083.0      Asia   31.997
3  Afghanistan  1967  11537966.0      Asia   34.020
4  Afghanistan  1972  13079460.0      Asia   36.088

In [22]:
df.loc[4,'country'] #using loc

'Afghanistan'

In [23]:
df.iloc[4,0] #using iloc

'Afghanistan'

In [24]:
#get the 1st ,100th,1000th rows from the 1st , 4th and 6th columns 
df.iloc[[0,99,999],[0,3,5]]

         country continent    gdpPercap
0    Afghanistan      Asia   779.445314
99    Bangladesh      Asia   721.186086
999     Mongolia      Asia  1226.041130